import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONObject;

public class Test11 {

    public static void main(String[] args) {
        JSONObject json = JSON.parseObject(" {\n" +
                "    '10': {\n" +
                "        name: '安徽',\n" +
                "        city: ['合肥', '芜湖', '蚌埠', '马鞍山', '淮北', '铜陵', '安庆', '黄山', '滁州', '宿州',\n" +
                "            '池州', '淮南', '巢湖', '阜阳', '六安', '宣城', '亳州']\n" +
                "    },\n" +
                "    '11': {\n" +
                "        name: '北京', city: ['北京']\n" +
                "    },\n" +
                "    '12': {\n" +
                "        name: '重庆', city: ['重庆']\n" +
                "    },\n" +
                "    '13': {\n" +
                "        name: '福建',\n" +
                "        city: ['福州', '厦门', '莆田', '三明', '泉州', '漳州', '南平', '龙岩', '宁德']\n" +
                "    },\n" +
                "    '14': {\n" +
                "        name: '甘肃',\n" +
                "        city: ['兰州', '嘉峪关', '金昌', '白银', '天水', '酒泉', '张掖', '武威', '定西',\n" +
                "            '陇南', '平凉', '庆阳', '临夏州', '甘南']\n" +
                "    },\n" +
                "    '15': {\n" +
                "        name: '广东',\n" +
                "        city: ['广州', '深圳', '珠海', '汕头', '东莞', '中山', '佛山', '韶关', '江门',\n" +
                "            '湛江', '茂名', '肇庆', '惠州', '梅州', '汕尾', '河源', '阳江', '清远', '潮州', '揭阳', '云浮']\n" +
                "    },\n" +
                "    '16': {\n" +
                "        name: '广西',\n" +
                "        city: ['南宁', '柳州', '桂林', '梧州', '北海', '防城港', '钦州', '贵港', '玉林', '贺州', '百色', '河池']\n" +
                "    },\n" +
                "    '17': {\n" +
                "        name: '贵州',\n" +
                "        city: ['贵阳', '六盘水', '遵义', '安顺', '铜仁', '黔西南', '毕节', '黔东南', '黔南']\n" +
                "    },\n" +
                "    '18': {\n" +
                "        name: '海南', city: ['海口', '三亚']\n" +
                "    },\n" +
                "    '19': {\n" +
                "        name: '河北',\n" +
                "        city: ['石家庄', '邯郸', '邢台', '保定', '张家口', '承德', '廊坊', '唐山', '秦皇岛', '沧州', '衡水']\n" +
                "    },\n" +
                "    '20': {\n" +
                "        name: '黑龙江',\n" +
                "        city: ['哈尔滨', '齐齐哈尔', '牡丹江', '佳木斯', '大庆', '绥化', '鹤岗', '鸡西',\n" +
                "            '黑河', '双鸭山', '伊春', '七台河', '大兴安岭']\n" +
                "    },\n" +
                "    '21': {\n" +
                "        name: '河南',\n" +
                "        city: ['郑州', '开封', '洛阳', '平顶山', '安阳', '鹤壁', '新乡', '焦作', '濮阳',\n" +
                "            '许昌', '漯河', '三门峡', '南阳', '商丘', '信阳', '周口', '驻马店', '济源']\n" +
                "    },\n" +
                "    '22': {\n" +
                "        name: '湖北',\n" +
                "        city: ['武汉', '宜昌', '荆州', '襄阳', '黄石', '荆门', '黄冈', '十堰', '恩施',\n" +
                "            '潜江', '天门', '仙桃', '随州', '咸宁', '孝感', '鄂州']\n" +
                "    },\n" +
                "    '23': {\n" +
                "        name: '湖南',\n" +
                "        city: ['长沙', '常德', '株洲', '湘潭', '衡阳', '岳阳', '邵阳', '益阳', '娄底',\n" +
                "            '怀化', '郴州', '永州', '湘西', '张家界']\n" +
                "    },\n" +
                "    '24': {\n" +
                "        name: '江西',\n" +
                "        city: ['南昌', '景德镇', '九江', '鹰潭', '萍乡', '新余', '赣州', '吉安', '宜春',\n" +
                "            '抚州', '上饶']\n" +
                "    },\n" +
                "    '25': {\n" +
                "        name: '江苏',\n" +
                "        city: ['南京', '镇江', '苏州', '南通', '扬州', '盐城', '徐州', '连云港', '常州',\n" +
                "            '无锡', '宿迁', '泰州', '淮安']\n" +
                "    },\n" +
                "    '26': {\n" +
                "        name: '吉林',\n" +
                "        city: ['长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城', '延边']\n" +
                "    },\n" +
                "    '27': {\n" +
                "        name: '辽宁',\n" +
                "        city: ['沈阳', '大连', '鞍山', '抚顺', '本溪', '丹东', '锦州', '营口', '阜新',\n" +
                "            '辽阳', '盘锦', '铁岭', '朝阳', '葫芦岛']\n" +
                "    },\n" +
                "    '28': {\n" +
                "        name: '内蒙古',\n" +
                "        city: ['呼和浩特', '包头', '乌海', '赤峰', '呼伦贝尔', '阿拉善盟', '哲里木盟',\n" +
                "            '兴安盟', '乌兰察布', '锡林郭勒', '巴彦淖尔', '伊克昭盟']\n" +
                "    },\n" +
                "    '29': {\n" +
                "        name: '宁夏', city: ['银川', '石嘴山', '吴忠', '固原']\n" +
                "    },\n" +
                "    '30': {\n" +
                "        name: '青海',\n" +
                "        city: ['西宁', '海东', '海南', '海北', '黄南', '玉树', '果洛', '海西']\n" +
                "    },\n" +
                "    '31': {\n" +
                "        name: '山东',\n" +
                "        city: ['济南', '青岛', '淄博', '枣庄', '东营', '烟台', '潍坊', '济宁', '泰安',\n" +
                "            '威海', '日照', '莱芜', '临沂', '德州', '聊城', '滨州', '菏泽']\n" +
                "    },\n" +
                "    '32': {\n" +
                "        name: '上海', city: ['上海']\n" +
                "    },\n" +
                "    '33': {\n" +
                "        name: '山西',\n" +
                "        city: ['太原', '大同', '阳泉', '长治', '晋城', '朔州', '吕梁', '忻州', '晋中', '临汾', '运城']\n" +
                "    },\n" +
                "    '34': {\n" +
                "        name: '陕西',\n" +
                "        city: ['西安', '宝鸡', '咸阳', '铜川', '渭南', '延安', '榆林', '汉中', '安康', '商洛']\n" +
                "    },\n" +
                "    '35': {\n" +
                "        name: '四川',\n" +
                "        city: ['成都', '绵阳', '德阳', '自贡', '攀枝花', '广元', '内江', '乐山', '南充',\n" +
                "            '宜宾', '广安', '达州', '雅安', '眉山', '甘孜', '凉山', '泸州']\n" +
                "    },\n" +
                "    '36': {\n" +
                "        name: '天津',\n" +
                "        city: ['天津']\n" +
                "    },\n" +
                "    '37': {\n" +
                "        name: '新疆',\n" +
                "        city: ['乌鲁木齐', '石河子', '克拉玛依', '伊犁', '巴音郭勒', '昌吉', '克孜勒苏柯尔',\n" +
                "            '克孜', '博尔塔拉', '吐鲁番', '哈密', '喀什', '和田', '阿克苏']\n" +
                "    },\n" +
                "    '38': {\n" +
                "        name: '西藏',\n" +
                "        city: ['拉萨', '日喀则', '山南', '林芝', '昌都', '阿里', '那曲']\n" +
                "    },\n" +
                "    '39': {\n" +
                "        name: '云南',\n" +
                "        city: ['昆明', '大理', '曲靖', '玉溪', '昭通', '楚雄', '红河', '文山', '思茅',\n" +
                "            '西双版纳', '保山', '德宏', '丽江', '怒江', '迪庆', '临沧']\n" +
                "    },\n" +
                "    '40': {\n" +
                "        name: '浙江',\n" +
                "        city: ['杭州', '宁波', '温州', '嘉兴', '湖州', '绍兴', '金华', '衢州', '舟山',\n" +
                "            '台州', '丽水']\n" +
                "    },\n" +
                "    '41': {\n" +
                "    \tname: '澳门',\n" +
                "    \tcity: ['澳门']\n" +
                "\t},\n" +
                "    '42': {\n" +
                "    \tname: '香港',\n" +
                "    \tcity: ['香港']\n" +
                "\t},\n" +
                "    '43': {\n" +
                "    \tname: '台湾',\n" +
                "    \tcity: ['台湾']\n" +
                "\t}\n" +
                "}");


        json.forEach((key, value) -> {
            ((JSONObject) value).getJSONArray("city").forEach(city -> {

                System.out.println(key + "\t" + ((JSONObject) value).getString("name") + "\t" + city);

            });


        });
    }

}
